scc2425-tukano/src/main/test/scc2425-artillery-tests/upload_shorts_out.txt
Test run id: tggck_r9mwgh5wtbnhkqbxbkf7w8a3bekqc_bt9p
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 21:26:45(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 21:26:55(+0000)

--------------------------------------
Metrics for period to: 21:26:50(+0000) (width: 3.619s)
--------------------------------------

http.codes.200: ................................................................ 6
http.codes.204: ................................................................ 6
http.downloaded_bytes: ......................................................... 2034
http.request_rate: ............................................................. 5/sec
http.requests: ................................................................. 12
http.response_time:
  min: ......................................................................... 108
  max: ......................................................................... 642
  mean: ........................................................................ 325.6
  median: ...................................................................... 376.2
  p95: ......................................................................... 415.8
  p99: ......................................................................... 415.8
http.response_time.2xx:
  min: ......................................................................... 108
  max: ......................................................................... 642
  mean: ........................................................................ 325.6
  median: ...................................................................... 376.2
  p95: ......................................................................... 415.8
  p99: ......................................................................... 415.8
http.responses: ................................................................ 12
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 6
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  6
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 108
  max: ......................................................................... 417
  mean: ........................................................................ 214.8
  median: ...................................................................... 156
  p95: ......................................................................... 301.9
  p99: ......................................................................... 301.9
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 375
  max: ......................................................................... 642
  mean: ........................................................................ 436.3
  median: ...................................................................... 399.5
  p95: ......................................................................... 407.5
  p99: ......................................................................... 407.5
vusers.completed: .............................................................. 6
vusers.created: ................................................................ 6
vusers.created_by_name.Upload short: ........................................... 6
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 518.9
  max: ......................................................................... 1080.2
  mean: ........................................................................ 663.2
  median: ...................................................................... 561.2
  p95: ......................................................................... 713.5
  p99: ......................................................................... 713.5


--------------------------------------
Metrics for period to: 21:27:00(+0000) (width: 5.735s)
--------------------------------------

http.codes.200: ................................................................ 24
http.codes.204: ................................................................ 24
http.downloaded_bytes: ......................................................... 8383
http.request_rate: ............................................................. 11/sec
http.requests: ................................................................. 48
http.response_time:
  min: ......................................................................... 62
  max: ......................................................................... 552
  mean: ........................................................................ 280.5
  median: ...................................................................... 333.7
  p95: ......................................................................... 424.2
  p99: ......................................................................... 424.2
http.response_time.2xx:
  min: ......................................................................... 62
  max: ......................................................................... 552
  mean: ........................................................................ 280.5
  median: ...................................................................... 333.7
  p95: ......................................................................... 424.2
  p99: ......................................................................... 424.2
http.responses: ................................................................ 48
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 24
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  24
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 62
  max: ......................................................................... 331
  mean: ........................................................................ 149.4
  median: ...................................................................... 153
  p95: ......................................................................... 165.7
  p99: ......................................................................... 267.8
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 385
  max: ......................................................................... 552
  mean: ........................................................................ 411.7
  median: ...................................................................... 407.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 424.2
vusers.completed: .............................................................. 24
vusers.created: ................................................................ 24
vusers.created_by_name.Upload short: ........................................... 24
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 488.9
  max: ......................................................................... 763.7
  mean: ........................................................................ 569.2
  median: ...................................................................... 561.2
  p95: ......................................................................... 620.3
  p99: ......................................................................... 658.6


All VUs finished. Total time: 12 seconds

--------------------------------
Summary report @ 21:26:58(+0000)
--------------------------------

http.codes.200: ................................................................ 30
http.codes.204: ................................................................ 30
http.downloaded_bytes: ......................................................... 10417
http.request_rate: ............................................................. 6/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 62
  max: ......................................................................... 642
  mean: ........................................................................ 289.6
  median: ...................................................................... 376.2
  p95: ......................................................................... 424.2
  p99: ......................................................................... 550.1
http.response_time.2xx:
  min: ......................................................................... 62
  max: ......................................................................... 642
  mean: ........................................................................ 289.6
  median: ...................................................................... 376.2
  p95: ......................................................................... 424.2
  p99: ......................................................................... 550.1
http.responses: ................................................................ 60
plugins.metrics-by-endpoint./tukano/rest/blobs/{{ blobUrl }}.codes.204: ........ 30
plugins.metrics-by-endpoint./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}.c...  30
plugins.metrics-by-endpoint.response_time./tukano/rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 62
  max: ......................................................................... 417
  mean: ........................................................................ 162.5
  median: ...................................................................... 156
  p95: ......................................................................... 301.9
  p99: ......................................................................... 333.7
plugins.metrics-by-endpoint.response_time./tukano/rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 375
  max: ......................................................................... 642
  mean: ........................................................................ 416.6
  median: ...................................................................... 407.5
  p95: ......................................................................... 424.2
  p99: ......................................................................... 550.1
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Upload short: ........................................... 30
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 488.9
  max: ......................................................................... 1080.2
  mean: ........................................................................ 588
  median: ...................................................................... 561.2
  p95: ......................................................................... 713.5
  p99: ......................................................................... 757.6